app/controllers/lsd_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT 1  [["id", 2]]
---
  def list
    cond = params[:id].present? ? ["name like ?","%#{params[:id]}%"] : "1=1"

    if @entity.attribute_method?('account')
      @entities=@entity.find(:all,:conditions=>cond).select{|e| e.account_id==@user.account.id};